 <h1 style="text-align: center; color: RED">TITANIC</h1>

In [5]:
import pandas as pd
import seaborn as sns

In [26]:
df = pd.read_csv("C:\\Users\\ASLI\\Desktop\\Patikadev-Kız Başına Bootcamp\\.ipynb_checkpoints\\Titanic_dataset.csv")

In [28]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Görev 1:Kazada ölenlerin yaş ortalamasını bulunuz?**

0 ölenleri 1 hayatta kalanalrı ifade eder.

In [34]:
df.groupby('Survived').agg({'Age':'mean'})

                Age
Survived
0         30.626179
1         28.343690

In [36]:
df.loc[df['Survived']==0,'Age'].mean() #sadece ölnelerin yaş ortalaması

30.62617924528302

**Görev 2:Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz?**

In [38]:
df.groupby('Survived').agg({'Fare':['mean','median']})

               Fare
               mean median
Survived
0         22.117887   10.5
1         48.395408   26.0

In [42]:
df.loc[df['Survived']==0,'Fare'].agg(['mean','median'])

mean      22.117887
median    10.500000
Name: Fare, dtype: float64

**Görev 3:Kazada ölen erkeklerin yaş ortalamasını bulunuz?**

In [64]:
df.groupby(['Survived','Sex']).agg({'Age':'mean'})

                       Age
Survived Sex
0        female  25.046875
         male    31.618056
1        female  28.847716
         male    27.276022

In [52]:
df.loc[(df['Survived']==0) & (df['Sex']=='male'),'Age'].mean()

31.618055555555557

**Görev 4:Kazada ölen Kadınların yaş ortalamasını bulunuz?**

In [57]:
df.loc[(df['Survived']==0) & (df['Sex']=='female'),'Age'].mean()

25.046875

**Görev 5:Kazadan kurtulanların yaş ortalamasını bulunuz?**

In [73]:
df.loc[df['Survived']==1,'Age'].mean()

28.343689655172415

**Görev 6:Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz?**

In [77]:
df.loc[df['Survived']==1,'Fare'].agg('mean')

48.39540760233918

**Görev 7:Kazadan kurtulan toplam kişi sayısını bulunuz… ?**

In [91]:
df['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [89]:
len(df[(df.Survived==1)])

342

In [99]:
df.loc[df['Survived']==1,'Survived'].count()

342

**Görev 8:10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz ?**

In [103]:
df.loc[df['Age'] < 10,'Fare'].median()

27.0

**Görev 9:1.sınıf, 2.sınıf ve 3.sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız. (Pclass değişkeni sınıfları barındırmaktadır.)**

In [112]:
df.groupby('Pclass').agg({'Fare':['mean','median']})

             Fare
             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

**Görev 10: Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız. (Örnek: erkekler için; ölen erkeklerin, erkek sayısına bölümü bu oranı vermektedir.**

In [121]:
#ölen erkeklerin oranı
(df.loc[(df['Survived'] == 0) & (df['Sex']=='male')].shape[0]) /( df.loc[df['Sex']=='male'].shape[0])

0.8110918544194108

In [125]:
#ölen kadınların oranı
(df.loc[(df['Survived'] == 0) & (df['Sex'] == 'female')].shape[0]) / (df.loc[df['Sex'] == 'female'].shape[0])

0.25796178343949044

In [127]:
df[df['Survived'] == 0]['Sex'].value_counts() / df['Sex'].value_counts()

Sex
male      0.811092
female    0.257962
Name: count, dtype: float64